# Пользователь вводит целое положительное число. Найдите
# самую большую цифру в числе. Для решения используйте
# цикл while и арифметические операции.

n = int(input('целое положительное число: '))

a = []
a.append(n)
while el in a:

    print(el)
